app/Controllers/KotaController.php

SELECT *
FROM `provinsi`
---
    public function index()
    {
        $pprovinsi=new ModelProvinsi();
        $kotaa= new ModelKota();
        $data =[
            'tampilkota' => $kotaa->getAll(),
            'provinsi' => $pprovinsi->findAll()

SELECT *
FROM `provinsi`
---
    public function new()
    {
        $pprovinsi= new ModelProvinsi();
        $data =[
            'tampildata' => $pprovinsi->findAll(),
        ];