app/Controllers/ProvinsiController.php

SELECT *
FROM `provinsi`
---
    public function index()
    {
        $pprovinsi= new ModelProvinsi();
        $data =[
            'tampildata' => $pprovinsi->findAll(),
        ];