app/Models/ModelKota.php

    public function getAll()
    {
        $builder = $this->db->table('kota');
        $builder->join('provinsi', 'provinsi.id_provinsi = kota.id_provinsi', 'inner');
        $query = $builder->get();
---
SELECT *
FROM `kota`
INNER JOIN `provinsi` ON `provinsi`.`id_provinsi` = `kota`.`id_provinsi`